Revit 2027 API
GlobalParameter.CanChangeReporting Method
 Tests whether the global parameter permits a change of its current value of the IsReporting attribute.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanChangeReporting()
Public Function CanChangeReporting As Boolean
public:
bool CanChangeReporting()
member CanChangeReporting : unit -> bool
Return Value
Boolean
 Returns True if the change is allowed; False otherwise.
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace